# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# 6 -> да
# 7 -> да
# 1 -> нет
weekday = int(input('Введите число дня недели: '))
if weekday >= 1 and weekday <= 5:
    print('Этот день - НЕ выходной')
elif weekday == 6 or weekday == 7:
    print('Этот день - выходной')
else:
    print('Введено некорректное число')