# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).
qtr = int(input('Введите номер четверти цифрой: '))
if qtr == 1:
    print('В 1-й четверти x > 0, y > 0')
elif qtr == 2:
    print('Во 2-й четверти x < 0, y > 0')
elif qtr == 3:
    print('В 3-й четверти x < 0, y < 0')
elif qtr == 4:
    print('В 4-й четверти x > 0, y < 0')
else:
    print('Вы ввели несуществующий номер четверти')